/*

《数据结构学习与实验指导》实验项目集


2-05. 求集合数据的均方差（15）


设计函数求N个给定整数的均方差。若将N个数A[]的平均值记为Avg，则均方差计算公式为：

  /----------------------------------------------------------
\/ [ (A1 - Avg)^2 + (A2 - Avg)^2 + ... + (AN - Avg)^2 ] / N


输入格式说明：

第1行输入正整数N（<=10000），第2行输入N个整数。

输出格式说明：

输出这N个数的均方差，要求固定精度输出小数点后5位。

样例输入与输出：

输入	
10
6 3 7 1 4 8 2 9 11 5
输出
3.03974

输入	
1
2
输出
0.00000



*/

#include <stdio.h>

int
main(int argc, char *argv[])
{
	int a, b;

	/* get two int */
	scanf("%d %d", &a, &b);

	/* output */
	printf("%d + %d = %d\n", a, b, a + b);
	printf("%d - %d = %d\n", a, b, a - b);
	printf("%d * %d = %d\n", a, b, a * b);
	printf("%d / %d = %d\n", a, b, a / b);

	return 0;
}
